lkolbly/cmsis-svd/data/ADI/ADuCM362.svd
<?xml version="1.0" encoding="utf-8" ?>
<device schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
   <vendor>Analog Devices Inc.</vendor>
	<vendorID>ADI</vendorID>
   <name>ADuCM362</name>
	<series>ADuCM36x</series>
	<version>0.1</version>
	<description>Cortex-M3 Microcontroller Device</description>
   <licenseText>   THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES INC. ``AS IS'' AND ANY EXPRESS OR
    IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF 
    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT, ARE  
    DISCLAIMED. IN NO EVENT SHALL ANALOG DEVICES INC. BE LIABLE FOR ANY DIRECT,  
    INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES           
    ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE   
    POSSIBILITY OF SUCH DAMAGE.                                                  
                                                                                 
    YOU ASSUME ANY AND ALL RISK FROM THE USE OF THIS CODE OR SUPPORT FILE.       
                                                                                 
    IT IS THE RESPONSIBILITY OF THE PERSON INTEGRATING THIS CODE INTO AN APPLICATION
    TO ENSURE THAT THE RESULTING APPLICATION PERFORMS AS REQUIRED AND IS SAFE.      
</licenseText>
	<cpu>
		<name>CM3</name>
		<revision>r2p1</revision>
		<endian>little</endian>
		<mpuPresent>false</mpuPresent>
		<fpuPresent>false</fpuPresent>
		<nvicPrioBits>3</nvicPrioBits>
		<vendorSystickConfig>false</vendorSystickConfig>
	</cpu>
 	<headerSystemFilename>system_ADuCM362</headerSystemFilename>
	<headerDefinitionsPrefix>ADI_</headerDefinitionsPrefix>
   <addressUnitBits>8</addressUnitBits>
	<width>32</width>

	<!-- Register Default Properties -->
	<!-- the size of the registers is set to a bit width of 32. This can be overruled for individual peripherals and/or registers -->
	<size>32</size>
	<!-- the access to all registers is set to be readable and writeable. This can be overruled for individual peripherals and/or registers -->
	<access>read-write</access>
	<!-- for demonstration purposes the resetValue for all registers of the device is set to be 0. This can be overruled within the description -->
	<resetValue>0</resetValue>
	<!-- the resetMask = 0 specifies that by default no register of this device has a defined reset value -->
	<resetMask>0</resetMask>
	<peripherals>
		<peripheral>
       <name>ADI_T0</name>
			<description>Timer 0</description>
       <groupName>T0</groupName>
			<baseAddress>0x40000000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIMER0</name>
				<value>11</value>
			</interrupt>
			<registers>
				<register>
					<name>T0LD</name>
					<description>16-bit load value</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Load value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T0VAL</name>
					<description>16-bit timer value, read only.</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T0CON</name>
					<description>Control Register</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x0000000A</resetValue>
					<fields>
						<field>
							<name>EVENTEN</name>
							<description>Enable time capture of an event</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EVENT</name>
							<description>Event Select, selects 1 of the available events.</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>T2</name>
									<description>- Wakeup Timer</description>
                     <value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT0</name>
									<description>- External interrupt 0</description>
                     <value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT1</name>
									<description>- External interrupt 1</description>
                     <value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT2</name>
									<description>- External interrupt 2</description>
                     <value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT3</name>
									<description>- External interrupt 3</description>
                     <value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT4</name>
									<description>- External interrupt 4</description>
                     <value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT5</name>
									<description>- External interrupt 5</description>
                     <value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT6</name>
									<description>- External interrupt 6</description>
                     <value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXT7</name>
									<description>- External interrupt 7</description>
                     <value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3</name>
									<description>- Watchdog timer</description>
                     <value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T1</name>
									<description>- Timer1</description>
                     <value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0</name>
									<description>- ADC0</description>
                     <value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC1</name>
									<description>- ADC1</description>
                     <value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STEP</name>
									<description>- STEP</description>
                     <value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMADONE</name>
                     <description>DMADONE</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FEE</name>
									<description>- Flash controller</description>
                     <value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RLD</name>
							<description>Timer reload on write to clear register</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLK</name>
							<description>Clock Select</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>UCLK</name>
									<description>- System Clock</description>
                     <value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PCLK</name>
									<description>- Peripheral clock</description>
                     <value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
									<description>- Internal 32 kHz Oscillator</description>
                     <value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
									<description>- External 32 kHz crystal</description>
                     <value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD</name>
							<description>Mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>FREERUN</name>
                     <description>FREERUN</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIODIC</name>
                     <description>PERIODIC</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UP</name>
							<description>Count-up</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE</name>
							<description>Prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
                     <description>DIV1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
                     <description>DIV16</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
                     <description>DIV256</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32768</name>
									<description>- If the selected clock source is UCLK then this setting results in a prescaler of 4.</description>
                     <value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T0CLRI</name>
					<description>Clear interrupt register</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CAP</name>
							<description>Clear captured event interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
							<description>Clear timeout interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T0CAP</name>
					<description>Capture Register</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Capture value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T0STA</name>
					<description>Status Register</description>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLRI</name>
							<description>Value updated in the timer clock domain</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON</name>
							<description>Ready to receive commands</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP</name>
							<description>Capture event pending</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMOUT</name>
							<description>Time out event occurred</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
