lkolbly/cmsis-svd/data/ADI/ADuCM362.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_PWRCTL</name>
			<description>Power Management Unit</description>
			<groupName>PWRCTL</groupName>
			<baseAddress>0x40002400</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x80</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PWRMOD</name>
					<description>Power modes register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000008</size>
             <resetValue>0x00000040</resetValue>
					<fields>
						<field>
							<name>WICENACK</name>
							<description>For Deepsleep mode only</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD</name>
							<description>Power Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>FULLACTIVE</name>
                     <description>FULLACTIVE</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCUHALT</name>
                     <description>MCUHALT</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PERHALT</name>
                     <description>PERHALT</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSHALT</name>
                     <description>SYSHALT</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOTALHALT</name>
                     <description>TOTALHALT</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIBERNATE</name>
                     <description>HIBERNATE</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWRKEY</name>
					<description>Key protection for the PWRMOD register.</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Key value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>KEY1</name>
                     <description>KEY1</description>
									<value>18521</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>KEY2</name>
                     <description>KEY2</description>
									<value>62075</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_RESET</name>
			<description>Reset</description>
			<groupName>RESET</groupName>
			<baseAddress>0x40002440</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>RSTSTA</name>
					<description>Reset Status</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000008</size>
             <access>read-only</access>
             <resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>SWRST</name>
							<description>Software reset status bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDRST</name>
							<description>Watchdog reset status bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTRST</name>
							<description>External reset status bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POR</name>
							<description>Power-on reset status bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTCLR</name>
					<description>Reset Status Clear</description>
					<alternateRegister>RSTSTA</alternateRegister>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000008</size>
             <access>write-only</access>
             <resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>SWRST</name>
							<description>Software reset status bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDRST</name>
							<description>Watchdog reset status bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTRST</name>
							<description>External reset status bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POR</name>
							<description>Power-on reset status bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
