lkolbly/cmsis-svd/data/ADI/ADuCM362.svd
				<register>
					<name>I2CSRX</name>
             <description>Slave Receive Data Register</description>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Receive register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CSTX</name>
             <description>Slave Transmit Data Register</description>
					<addressOffset>0x00000034</addressOffset>
					<size>0x00000010</size>
             <access>write-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Transmit register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CALT</name>
             <description>Hardware General Call ID</description>
					<addressOffset>0x00000038</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Alt register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CID0</name>
             <description>1st Slave Address Device ID</description>
					<addressOffset>0x0000003C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Slave ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CID1</name>
             <description>2nd Slave Address Device ID</description>
					<addressOffset>0x00000040</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Slave ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CID2</name>
             <description>3rd Slave Address Device ID</description>
					<addressOffset>0x00000044</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Slave ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CID3</name>
             <description>4th Slave Address Device ID</description>
					<addressOffset>0x00000048</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Slave ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CFSTA</name>
             <description>Master and Slave Rx/Tx FIFO Status Register</description>
					<addressOffset>0x0000004C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MFLUSH</name>
							<description>Flush the master transmit FIFO</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SFLUSH</name>
							<description>Flush the slave transmit FIFO</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MRXFSTA</name>
							<description>Master receive FIFO Status</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
                     <description>EMPTY</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONEBYTE</name>
                     <description>ONEBYTE</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWOBYTES</name>
                     <description>TWOBYTES</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MTXFSTA</name>
							<description>Master Transmit FIFO Status</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
                     <description>EMPTY</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONEBYTE</name>
                     <description>ONEBYTE</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWOBYTES</name>
                     <description>TWOBYTES</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRXFSTA</name>
							<description>Slave receive FIFO Status</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
                     <description>EMPTY</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONEBYTE</name>
                     <description>ONEBYTE</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWOBYTES</name>
                     <description>TWOBYTES</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STXFSTA</name>
							<description>Slave Transmit FIFO Status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
                     <description>EMPTY</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONEBYTE</name>
                     <description>ONEBYTE</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWOBYTES</name>
                     <description>TWOBYTES</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
