lkolbly/cmsis-svd/data/ADI/ADuCM362.svd
				<register>
					<name>SPI0DMA</name>
             <description>DMA enable register</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IENRXDMA</name>
							<description>Enable receive DMA request</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IENTXDMA</name>
							<description>Enable transmit DMA request</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable DMA for data transfer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SPI0CNT</name>
             <description>8-bit received byte count register</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Count</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_SPI1</name>
			<description>Serial Peripheral Interface</description>
			<groupName>SPI1</groupName>
			<baseAddress>0x40004400</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1C</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SPI1</name>
				<value>19</value>
			</interrupt>
			<registers>
				<register>
					<name>SPI1STA</name>
					<description>Status Register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CSERR</name>
							<description>Detected an abrupt CS deassertion</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXS</name>
							<description>Set when there are more bytes in the RX FIFO than the TIM bit says</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXFSTA</name>
							<description>Receive FIFO Status</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
                     <description>EMPTY</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONEBYTE</name>
                     <description>ONEBYTE</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWOBYTES</name>
                     <description>TWOBYTES</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THREEBYTES</name>
                     <description>THREEBYTES</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FOURBYTES</name>
                     <description>FOURBYTES</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXOF</name>
							<description>Receive FIFO overflow</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RX</name>
							<description>Set when a receive interrupt occurs</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TX</name>
							<description>Set when a transmit interrupt occurs</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXUR</name>
							<description>Transmit FIFO underflow</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXFSTA</name>
							<description>transmit FIFO Status</description>
							<bitOffset>1</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
                     <description>EMPTY</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONEBYTE</name>
                     <description>ONEBYTE</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWOBYTES</name>
                     <description>TWOBYTES</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THREEBYTES</name>
                     <description>THREEBYTES</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FOURBYTES</name>
                     <description>FOURBYTES</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ</name>
							<description>Interrupt status bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SPI1RX</name>
					<description>8-bit Receive register.</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000008</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Received data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>SPI1TX</name>
					<description>8-bit Transmit register</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000008</size>
             <access>write-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Data to transmit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>SPI1DIV</name>
					<description>SPI Clock Divider Registers</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BCRST</name>
							<description>Bit counter reset</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIV</name>
							<description>Factor used to divide UCLK to generate the serial clock</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
