lkolbly/cmsis-svd/data/ADI/ADuCM362.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_DMA</name>
			<description>Direct Memory Access</description>
			<groupName>DMA</groupName>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DMA_ERR</name>
				<value>22</value>
			</interrupt>
			<interrupt>
				<name>DMA_SPI1_TX</name>
				<value>23</value>
			</interrupt>
			<interrupt>
				<name>DMA_SPI1_RX</name>
				<value>24</value>
			</interrupt>
			<interrupt>
				<name>DMA_UART_TX</name>
				<value>25</value>
			</interrupt>
			<interrupt>
				<name>DMA_UART_RX</name>
				<value>26</value>
			</interrupt>
			<interrupt>
				<name>DMA_I2CS_TX</name>
				<value>27</value>
			</interrupt>
			<interrupt>
				<name>DMA_I2CS_RX</name>
				<value>28</value>
			</interrupt>
			<interrupt>
				<name>DMA_I2CM_TX</name>
				<value>29</value>
			</interrupt>
			<interrupt>
				<name>DMA_I2CM_RX</name>
				<value>30</value>
			</interrupt>
			<interrupt>
				<name>DMA_DAC</name>
				<value>31</value>
			</interrupt>
			<interrupt>
				<name>DMA_ADC0</name>
				<value>32</value>
			</interrupt>
			<interrupt>
				<name>DMA_ADC1</name>
				<value>33</value>
			</interrupt>
			<interrupt>
				<name>DMA_SINC2</name>
				<value>34</value>
			</interrupt>
			<registers>
				<register>
					<name>DMASTA</name>
             <description>Returns the status of the controller when not in the reset state.</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000020</size>
             <access>read-only</access>
             <resetValue>0x000B0000</resetValue>
					<fields>
						<field>
							<name>CHNLSMINUS1</name>
							<description>Number of available DMA channels minus one.</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>FOURTEENCHNLS</name>
									<description>- Controller configured to use 14 DMA channels</description>
                     <value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWELVECHNLS</name>
									<description>- Controller configured to use 12 DMA channels</description>
                     <value>11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STATE</name>
							<description>Current state of the control state machine.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>IDLE</name>
									<description>- Idle</description>
                     <value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RDCHNLDATA</name>
									<description>- Reading channel controller data</description>
                     <value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RDSRCENDPTR</name>
									<description>- Reading source data end pointer</description>
                     <value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RDDSTENDPTR</name>
									<description>- Reading destination data end pointer</description>
                     <value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RDSRCDATA</name>
									<description>- Reading source data</description>
                     <value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRDSTDATA</name>
									<description>- Writing destination data</description>
                     <value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITDMAREQCLR</name>
									<description>- Waiting for DMA request to clear</description>
                     <value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRCHNLDATA</name>
									<description>- Writing channel controller data</description>
                     <value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STALLED</name>
									<description>- Stalled</description>
                     <value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DONE</name>
									<description>- Done</description>
                     <value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCATRGATHR</name>
									<description>- Peripheral scatter-gather transition</description>
                     <value>10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Master DMA controller enable status.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACFG</name>
             <description>Configuraton</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>Master DMA controller enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAPDBPTR</name>
             <description>Channel primary control database pointer</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CTRLBASEPTR</name>
							<description>Pointer to the base address of the primary data structure</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAADBPTR</name>
             <description>Channel alt control database pointer</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000020</size>
             <access>read-only</access>
             <resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>ALTCBPTR</name>
							<description>Pointer to the base address of the alternate data structure</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DMASWREQ</name>
             <description>Channel Software Request</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000020</size>
             <access>write-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SINC2</name>
							<description>SINC2 Output Step detection</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1</name>
							<description>ADC1</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC0</name>
							<description>ADC0</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DAC</name>
							<description>DAC DMA Output</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CMRX</name>
							<description>DMA I2C Master RX</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CMTX</name>
							<description>DMA I2C Master TX</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CSRX</name>
							<description>DMA I2C Slave RX</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CSTX</name>
							<description>DMA I2C Slave TX</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UARTRX</name>
							<description>DMA UART RX</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UARTTX</name>
							<description>DMA UART TX</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI1RX</name>
							<description>DMA SPI 1 RX</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI1TX</name>
							<description>DMA SPI 1 TX</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
