lkolbly/cmsis-svd/data/ADI/ADuCM362.svd
         <register>
             <name>IPR7</name>
             <description>IRQ28..31 Priority</description>
             <addressOffset>0x0000041C</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>DMADAC</name>
                 <description>TBD</description>
                 <bitOffset>24</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>DMAI2CMRX</name>
                 <description>TBD</description>
                 <bitOffset>16</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>DMAI2CMTX</name>
                 <description>TBD</description>
                 <bitOffset>8</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>DMAI2CSRX</name>
                 <description>TBD</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>IPR8</name>
             <description>IRQ32..35 Priority</description>
             <addressOffset>0x00000420</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>PWMTRIP</name>
                 <description>TBD</description>
                 <bitOffset>24</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>DMASINC2</name>
                 <description>TBD</description>
                 <bitOffset>16</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>DMAADC1</name>
                 <description>TBD</description>
                 <bitOffset>8</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>DMAADC0</name>
                 <description>TBD</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>IPR9</name>
             <description>IRQ36..39 Priority</description>
             <addressOffset>0x00000424</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>PWM2</name>
                 <description>TBD</description>
                 <bitOffset>16</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>PWM1</name>
                 <description>TBD</description>
                 <bitOffset>8</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>PWM0</name>
                 <description>TBD</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>CPUID</name>
             <description>CPUID Base</description>
             <addressOffset>0x00000D00</addressOffset>
             <size>0x00000020</size>
             <access>read-only</access>
             <resetValue>0x412FC230</resetValue>
             <fields>
               <field>
                 <name>IMPLEMENTER</name>
                 <description>Indicates implementor</description>
                 <bitOffset>24</bitOffset>
                 <bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>VARIANT</name>
                 <description>Indicates processor revision</description>
                 <bitOffset>20</bitOffset>
                 <bitWidth>4</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>PARTNO</name>
                 <description>Indicates part number</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>12</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>REVISION</name>
                 <description>Indicates patch release</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>4</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>ICSR</name>
             <description>Interrupt Control and State Register</description>
             <addressOffset>0x00000D04</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>NMIPENDSET</name>
                 <description>Setting this bit will activate an NMI</description>
                 <bitOffset>31</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PENDSVSET</name>
                 <description>Set a pending PendSV interrupt</description>
                 <bitOffset>28</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PENDSVCLR</name>
                 <description>Clear a pending PendSV interrupt</description>
                 <bitOffset>27</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PENDSTSET</name>
                 <description>Set a pending SysTick. Reads back with current state</description>
                 <bitOffset>26</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PENDSTCLR</name>
                 <description>Clear a pending SysTick</description>
                 <bitOffset>25</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ISRPREEMPT</name>
                 <description>If set, a pending exception will be serviced on exit from the debug halt state</description>
                 <bitOffset>23</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ISRPENDING</name>
                 <description>Indicates if an external configurable is pending</description>
                 <bitOffset>22</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>VECTPENDING</name>
                 <description>Indicates the exception number for the highest priority pending exception</description>
                 <bitOffset>12</bitOffset>
                 <bitWidth>9</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000001FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>RETTOBASE</name>
                 <description>TBD</description>
                 <bitOffset>11</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>VECTACTIVE</name>
                 <description>Thread mode, or exception number</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>9</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000001FF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>VTOR</name>
             <description>Vector Table Offset Register</description>
             <addressOffset>0x00000D08</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>TBLBASE</name>
                 <description>TBD</description>
                 <bitOffset>29</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TBLOFF</name>
                 <description>TBD</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>22</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x003FFFFF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>AIRCR</name>
             <description>Application Interrupt and Reset Control Register</description>
             <addressOffset>0x00000D0C</addressOffset>
             <size>0x00000020</size>
             <resetValue>0xFA050000</resetValue>
             <fields>
               <field>
                 <name>VECTKEYSTAT</name>
                 <description>Reads as 0xFA05</description>
                 <bitOffset>16</bitOffset>
                 <bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>ENDIANESS</name>
                 <description>This bit is static or configured by a hardware input on reset</description>
                 <bitOffset>15</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PRIGROUP</name>
                 <description>Priority grouping position</description>
                 <bitOffset>8</bitOffset>
                 <bitWidth>3</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                      </range>
                 </writeConstraint>
               </field>
               <field>
                 <name>SYSRESETREQ</name>
                 <description>System Reset Request</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>VECTCLRACTIVE</name>
                 <description>Clears all active state information for fixed and configurable exceptions</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>VECTRESET</name>
                 <description>Local system reset</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
         </register>
