lkolbly/cmsis-svd/data/ADI/ADuCM362.svd
				<register>
					<name>ADCCFG</name>
             <description>Control register for the VBIAS voltage generator, ground switch and external reference buffer</description>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x0000000F</resetValue>
					<fields>
						<field>
							<name>SIMU</name>
							<description>Enable both ADCs</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOOST30</name>
							<description>Boost the Vbias current source ability by 30 times</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PINSEL</name>
							<description>Enable vbias generator, send vbias to selected ain pin bits</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Disable VBIAS generator</description>
                     <value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
                     <description>AIN7</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN11</name>
                     <description>AIN11</description>
									<value>6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GNDSWON</name>
							<description>GND_SW</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GNDSWRESEN</name>
							<description>20k resistor in series with GND_SW</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTBUF</name>
							<description>Control signals for ext_ref buffers bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
                     <description>OFF</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFPN</name>
                     <description>VREFPN</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFP_VREF2P</name>
                     <description>VREFP_VREF2P</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0FLT</name>
             <description>Filter configuration register</description>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x0000007D</resetValue>
					<fields>
						<field>
							<name>CHOP</name>
							<description>Enables System-Chopping bits</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
                     <description>OFF</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
                     <description>ON</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RAVG2</name>
							<description>Enables a running Average-By-2 bits</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
                     <description>OFF</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
                     <description>ON</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SINC4EN</name>
							<description>Enable the Sinc4 filter instead of Sinc3 filter.</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AF</name>
							<description>Averaging filter</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                      </range>
                 </writeConstraint>
						</field>
						<field>
							<name>NOTCH2</name>
							<description>Inserts a notch at FNOTCH2</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SF</name>
							<description>SINC Filter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000007F</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0MDE</name>
             <description>mode control register</description>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PGA</name>
							<description>PGA Gain Select bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>G1</name>
                     <description>G1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G2</name>
                     <description>G2</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G4</name>
                     <description>G4</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G8</name>
                     <description>G8</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G16</name>
                     <description>G16</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G32</name>
                     <description>G32</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G64</name>
                     <description>G64</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>G128</name>
                     <description>G128</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCMOD2</name>
							<description>ADC modulator gain of 2 control bits</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>MOD2OFF</name>
                     <description>MOD2OFF</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MOD2ON</name>
                     <description>MOD2ON</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCMD</name>
							<description>ADC Mode bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
                     <description>OFF</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONT</name>
                     <description>CONT</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SINGLE</name>
                     <description>SINGLE</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDLE</name>
                     <description>IDLE</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTOCAL</name>
                     <description>INTOCAL</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTGCAL</name>
                     <description>INTGCAL</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSOCAL</name>
                     <description>SYSOCAL</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSGCAL</name>
                     <description>SYSGCAL</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0RCR</name>
             <description>Number of ADC0 conversions before an ADC interrupt is generated.</description>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0RCV</name>
             <description>This 16-bit, read-only MMR holds the current number of ADC0 conversion results</description>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0TH</name>
             <description>Sets the threshold</description>
					<addressOffset>0x00000030</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0THC</name>
             <description>Determines how many cumulative ADC0 conversion result readings above ADC0TH must occur</description>
					<addressOffset>0x00000034</addressOffset>
					<size>0x00000008</size>
             <resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0THV</name>
             <description>8-bit threshold exceeded counter register</description>
					<addressOffset>0x00000038</addressOffset>
					<size>0x00000008</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0ACC</name>
             <description>32-bit accumulator register</description>
					<addressOffset>0x0000003C</addressOffset>
					<size>0x00000020</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0ATH</name>
             <description>Holds the threshold value for the accumulator comparator</description>
					<addressOffset>0x00000040</addressOffset>
					<size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0PRO</name>
             <description>Configuration register for Post processing of ADC0 results</description>
					<addressOffset>0x00000044</addressOffset>
					<size>0x00000008</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ACCEN</name>
							<description>ADC Accumulator Enable bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
                     <description>Off</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>En</name>
                     <description>En</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnNDec</name>
                     <description>EnNDec</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnAccCnt</name>
                     <description>EnAccCnt</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPEN</name>
							<description>ADC Comparator Enable bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>Off</name>
                     <description>Off</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>En</name>
                     <description>En</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnCnt</name>
                     <description>EnCnt</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EnCntDec</name>
                     <description>EnCntDec</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OREN</name>
							<description>ADC OverRange Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCEN</name>
							<description>ADC Result Counter Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0DAT</name>
             <description>conversion result register</description>
					<addressOffset>0x00000048</addressOffset>
					<size>0x00000020</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
